import mapping from '../appealContent/mapping.js'

const M = mapping.topicList;

const categories = ["категорииVVV   поля>>>", "Жалоба на постановление по делу об АПН", "Ходатайство о восстановлении срока обжалования постановления", "Ходатайство о переносе срока рассмотрения дела об АПН", "Внесение информации об оплате административного шт…рждение отсутствия задолженности по оплате штрафа", "Возврат денежных средств", "Предоставление копии постановления# протокола# других материалов дела", "Внесение информации об отмене постановления", "Привлечение к административной ответственности по ч.5 ст.12.16,1", "Жалоба на отсутствие ответа на ранее поданную жалобу или на ненадлежащий ответ", "Жалоба на работу МАДИ", "Жалоба на действия должностных лиц", "Запрос информации о причине передачи дела об АПН в ФССП России", "Разъяснение порядка обжалования# оплаты# эвакуации", "Досудебная претензия", "Обращение по вопросу нарушения правил остановки и стоянки легковыми такси", "Обращение по вопросу нарушения правил перевозок пассажиров легковыми такси", "Обращения не относящиеся к сфере деятельности МАДИ", "Несогласие с протоколом об АПН", "Обращение по вопросам прохождения государственной службы", "Обращение содержащее несколько вопросов компетенции разных управлений", "Повторное обжалование постановлений", "Привлечение к административной ответственности за стоянку на газоне", "Привлечение к административной ответственности за …ри погрузочно-разгрузочных работах в ночное время", "Обращения Mos.Ru", "Ознакомление с материалами дела об АПН", "Заявление о продлении льготного периода оплаты штрафа", "Дополнительные материалы", "Предоставление реквизитов для оплаты постановлений", "Заявление о предоставлении отсрочки/рассрочки по оплате штрафа", "Заявление о прекращении исполнения постановления", "Обращение по вопросам перемещения ТС без ГРЗ", "Иное", "Парковочное разрешение многодетной семьи (МПР)", "Парковочное разрешение инвалида (ИПР)", "Абонементы", "Парковочные карты", "Сайт", "Колл-центр", "Мобильное приложение", "СМС-сервис", "Парковочный счет", "Оплата парковки", "Организация парковочного пространства", "Паркомат", "Эвакуация", "Штрафы"];

const fields = [
	{field: M.CODEX_ARTICLE.name , label: 'Статья кодекса'},
	{field: M.OWNER_TS.name,       label: 'Владелец транспортного средства'},
	{field: M.OWNER_TS_ADR.name,   label: 'Адрес владельца транспортного средства'},
	{field: M.APPEAL_APN.name,     label: 'Причина жалобы на постановление по делу об АПН  (В случае отмены указывается причина отменены)'},
	{field: M.UCH_PRIS.name,       label: 'Необходимо присутствие участника'},
	{field: M.RASSMOTR_DATE.name,  label: 'Дата рассмотрения дела'},
	{field: M.RASSMOTR_TIME.name,  label: 'Время рассмотрения дела'},
	{field: M.DECISION_THEME.name, label: 'Решение по теме'},
	{field: M.DECISION_BASIS.name, label: 'Основания для решения'},
	{field: M.APN_ADR.name,        label: 'Адрес АПН'},
	{field: M.APN_DATA.name,       label: 'Дата АПН'},
	{field: M.DESCRIPTION.name,    label: 'Описание'},
	{field: M.DESISION_MAKER.name, label: 'Решение принял руководитель'},
	{field: M.DECISION_DATE.name,  label: 'Дата принятия решения'},
	{field: M.VIOLATOR_REGNO.name, label: 'ГРЗ нарушителя'},
	{field: M.APPEAL_CAUSE.name,   label: 'Причина обращения'}
];

const matrix = [
[categories[ 0],fields[ 0],fields[ 1],fields[ 2],fields[ 3],fields[ 4],fields[ 5],fields[ 6],fields[ 7],fields[ 8],fields[ 9],fields[10],fields[11],fields[12],fields[13],fields[14],fields[15]],

[categories[ 1],1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0],
[categories[ 2],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[ 3],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[ 4],1,0,0,0,1,1,1,1,0,1,1,1,0,0,0,1],
[categories[ 5],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[ 6],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[ 7],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[ 8],0,0,0,1,1,1,1,0,1,1,1,0,0,1,0,0],
[categories[ 9],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[10],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[11],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[12],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[13],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[14],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[15],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[16],1,0,0,0,1,1,1,1,1,1,1,1,0,0,1,0],
[categories[17],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[18],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[19],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[20],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[21],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[22],1,0,0,0,1,1,1,1,1,1,1,1,0,0,1,0],
[categories[23],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[24],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[25],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[26],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[27],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[28],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[29],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[30],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[31],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[32],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[33],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[34],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[35],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[36],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[37],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[38],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[39],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[40],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[41],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[42],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[43],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[44],1,0,0,0,1,1,1,1,0,1,1,1,0,0,1,0],
[categories[45],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0],
[categories[46],1,0,0,0,1,1,1,1,0,0,0,1,0,0,0,0]]


export {fields,categories,matrix}